/* Урок 47:
 * Сериализация (часть 2). Сериализация массивов.
 * Ссылка на видеоурок https://www.youtube.com/watch?v=7QZ6oZ51o0U
 * 
 * Сериализация (Serialization) - это процесс преобразования структуры данных 
 * в линейную последовательность байтов для дальнейшей передачи или сохранения. 
 * Сериализованные объекты можно затем восстановить (десериализовать). 
 * В Java, согласно спецификации Java Object Serialization существует 
 * два стандартных способа сериализации: 
 * стандартная сериализация, через использование интерфейса java.io.Serializable 
 * и «расширенная» сериализация - java.io.Externalizable.
 * 
 * В лекции:
 * - ЗАПИСЬ массива в файл, реализована через WraiteObject 
 * - ЧТЕНИЕ массива из файла, реализована через ReadObject
 * 
 */

public class lesson47 {
   
}