/* Урок 46:
 * Сериализация (часть 1).
 * Ссылка на видеоурок https://www.youtube.com/watch?v=dBcqizwOWLg
 * 
 * Сериализация (Serialization) - это процесс преобразования структуры данных 
 * в линейную последовательность байтов для дальнейшей передачи или сохранения. 
 * Сериализованные объекты можно затем восстановить (десериализовать). 
 * В Java, согласно спецификации Java Object Serialization существует 
 * два стандартных способа сериализации: 
 * стандартная сериализация, через использование интерфейса java.io.Serializable 
 * и «расширенная» сериализация - java.io.Externalizable.
 * 
 * В лекции:
 * - ЗАПИСЬ в файл, реализована через WraiteObject 
 * - ЧТЕНИЕ из файла, реализована через ReadObject
 * 
 */

public class lesson46 {
   
}